perf-tests/reports/after-fix-50vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf-tests/k6/scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m00.7s/2m0s

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m01.7s/2m0s

running (0m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m02.7s/2m0s

running (0m04.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m03.7s/2m0s

running (0m05.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  0m04.7s/2m0s

running (0m06.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m05.7s/2m0s

running (0m07.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m06.7s/2m0s

running (0m08.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m07.7s/2m0s

running (0m09.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m08.7s/2m0s

running (0m10.0s), 50/50 VUs, 20 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m09.7s/2m0s

running (0m11.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  0m10.7s/2m0s

running (0m12.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m11.7s/2m0s

running (0m13.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m12.7s/2m0s

running (0m14.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m13.7s/2m0s

running (0m15.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m14.7s/2m0s

running (0m16.0s), 50/50 VUs, 56 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m15.7s/2m0s

running (0m17.0s), 50/50 VUs, 84 complete and 0 interrupted iterations
default   [  14% ] 50 VUs  0m16.7s/2m0s

running (0m18.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m17.7s/2m0s

running (0m19.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m18.7s/2m0s

running (0m20.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m19.7s/2m0s

running (0m21.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m20.7s/2m0s

running (0m22.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m21.7s/2m0s

running (0m23.0s), 50/50 VUs, 123 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  0m22.7s/2m0s

running (0m24.0s), 50/50 VUs, 148 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m23.7s/2m0s

running (0m25.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  0m24.7s/2m0s

running (0m26.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  0m25.7s/2m0s

running (0m27.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m26.7s/2m0s

running (0m28.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m27.7s/2m0s

running (0m29.0s), 50/50 VUs, 158 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  0m28.7s/2m0s

running (0m30.0s), 50/50 VUs, 186 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m29.7s/2m0s

running (0m31.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  0m30.7s/2m0s

running (0m32.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  0m31.7s/2m0s

running (0m33.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m32.7s/2m0s

running (0m34.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m33.7s/2m0s

running (0m35.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  0m34.7s/2m0s

running (0m36.0s), 50/50 VUs, 225 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m35.7s/2m0s

running (0m37.0s), 50/50 VUs, 237 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  0m36.7s/2m0s

running (0m38.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  0m37.7s/2m0s

running (0m39.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m38.7s/2m0s

running (0m40.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m39.7s/2m0s

running (0m41.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  34% ] 50 VUs  0m40.7s/2m0s

running (0m42.0s), 50/50 VUs, 261 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m41.7s/2m0s

running (0m43.0s), 50/50 VUs, 281 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  0m42.7s/2m0s

running (0m44.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  0m43.7s/2m0s

running (0m45.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m44.7s/2m0s

running (0m46.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m45.7s/2m0s

running (0m47.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  0m46.7s/2m0s

running (0m48.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m47.7s/2m0s

running (0m49.0s), 50/50 VUs, 325 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  0m48.7s/2m0s

running (0m50.0s), 50/50 VUs, 337 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  0m49.7s/2m0s

running (0m51.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m50.7s/2m0s

running (0m52.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m51.7s/2m0s

running (0m53.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  0m52.7s/2m0s

running (0m54.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m53.7s/2m0s

running (0m55.0s), 50/50 VUs, 365 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  0m54.7s/2m0s

running (0m56.0s), 50/50 VUs, 383 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  0m55.7s/2m0s

running (0m57.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m56.7s/2m0s

running (0m58.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m57.7s/2m0s

running (0m59.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  0m58.7s/2m0s

running (1m00.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  0m59.7s/2m0s

running (1m01.0s), 50/50 VUs, 401 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  1m00.7s/2m0s

running (1m02.0s), 50/50 VUs, 425 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  1m01.7s/2m0s

running (1m03.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  1m02.7s/2m0s

running (1m04.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  1m03.7s/2m0s

running (1m05.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  54% ] 50 VUs  1m04.7s/2m0s

running (1m06.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  1m05.7s/2m0s

running (1m07.0s), 50/50 VUs, 451 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  1m06.7s/2m0s

running (1m08.0s), 50/50 VUs, 467 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  1m07.7s/2m0s

running (1m09.0s), 50/50 VUs, 487 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  1m08.7s/2m0s

running (1m10.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  1m09.7s/2m0s

running (1m11.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  1m10.7s/2m0s

running (1m12.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  1m11.7s/2m0s

running (1m13.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  1m12.7s/2m0s

running (1m14.0s), 50/50 VUs, 501 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  1m13.7s/2m0s

running (1m15.0s), 50/50 VUs, 525 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  1m14.7s/2m0s

running (1m16.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  1m15.7s/2m0s

running (1m17.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  1m16.7s/2m0s

running (1m18.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  1m17.7s/2m0s

running (1m19.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  1m18.7s/2m0s

running (1m20.0s), 50/50 VUs, 551 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  1m19.7s/2m0s

running (1m21.0s), 50/50 VUs, 558 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  1m20.7s/2m0s

running (1m22.0s), 50/50 VUs, 582 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  1m21.7s/2m0s

running (1m23.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  1m22.7s/2m0s

running (1m24.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  1m23.7s/2m0s

running (1m25.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  1m24.7s/2m0s

running (1m26.0s), 50/50 VUs, 601 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  1m25.7s/2m0s

running (1m27.0s), 50/50 VUs, 604 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  1m26.7s/2m0s

running (1m28.0s), 50/50 VUs, 630 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  1m27.7s/2m0s

running (1m29.0s), 50/50 VUs, 642 complete and 0 interrupted iterations
default   [  74% ] 50 VUs  1m28.7s/2m0s

running (1m30.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  1m29.7s/2m0s

running (1m31.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  1m30.7s/2m0s

running (1m32.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  1m31.7s/2m0s

running (1m33.0s), 50/50 VUs, 651 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  1m32.7s/2m0s

running (1m34.0s), 50/50 VUs, 662 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  1m33.7s/2m0s

running (1m35.0s), 50/50 VUs, 691 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  1m34.7s/2m0s

running (1m36.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  1m35.7s/2m0s

running (1m37.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  1m36.7s/2m0s

running (1m38.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  1m37.7s/2m0s

running (1m39.0s), 50/50 VUs, 701 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  1m38.7s/2m0s

running (1m40.0s), 50/50 VUs, 712 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  1m39.7s/2m0s

running (1m41.0s), 50/50 VUs, 719 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  1m40.7s/2m0s

running (1m42.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  1m41.7s/2m0s

running (1m43.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  1m42.7s/2m0s

running (1m44.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  1m43.7s/2m0s

running (1m45.0s), 50/50 VUs, 751 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  1m44.7s/2m0s

running (1m46.0s), 50/50 VUs, 758 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  1m45.7s/2m0s

running (1m47.0s), 50/50 VUs, 766 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  1m46.7s/2m0s

running (1m48.0s), 50/50 VUs, 778 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  1m47.7s/2m0s

running (1m49.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  1m48.7s/2m0s

running (1m50.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  1m49.7s/2m0s

running (1m51.0s), 50/50 VUs, 801 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  1m50.7s/2m0s

running (1m52.0s), 50/50 VUs, 801 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  1m51.7s/2m0s

running (1m53.0s), 50/50 VUs, 812 complete and 0 interrupted iterations
default   [  94% ] 50 VUs  1m52.7s/2m0s

running (1m54.0s), 50/50 VUs, 823 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  1m53.7s/2m0s

running (1m55.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  1m54.7s/2m0s

running (1m56.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  1m55.7s/2m0s

running (1m57.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  1m56.7s/2m0s

running (1m58.0s), 50/50 VUs, 851 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  1m57.7s/2m0s

running (1m59.0s), 50/50 VUs, 862 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  1m58.7s/2m0s

running (2m00.0s), 50/50 VUs, 872 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  1m59.7s/2m0s

running (2m01.0s), 38/50 VUs, 885 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  2m0s

running (2m02.0s), 23/50 VUs, 900 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  2m0s

running (2m03.0s), 23/50 VUs, 900 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  2m0s

running (2m04.0s), 22/50 VUs, 901 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  2m0s

running (2m05.0s), 11/50 VUs, 912 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  2m0s

running (2m06.0s), 05/50 VUs, 918 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  2m0s


  █ THRESHOLDS 

    create_shipment_duration
    ✓ 'p(95)<1000' p(95)=47.4598

    dashboard_duration
    ✗ 'p(95)<1000' p(95)=1109.151

    http_req_duration
    ✓ 'p(95)<1000' p(95)=415.69ms
    ✓ 'p(99)<2000' p(99)=1.26s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    login_duration
    ✗ 'p(95)<1000' p(95)=2329.068

    search_duration
    ✓ 'p(95)<1000' p(95)=278.6705


  █ TOTAL RESULTS 

    checks_total.......: 5589    44.212807/s
    checks_succeeded...: 100.00% 5589 out of 5589
    checks_failed......: 0.00%   0 out of 5589

    ✓ login 200
    ✓ dashboard 200
    ✓ search 200
    ✓ open shipment 200
    ✓ track 200
    ✓ create shipment 201/200
    ✓ update shipment 200

    CUSTOM
    create_shipment_duration.......: avg=23.573146   min=6.97    med=20.025   max=96.405   p(90)=39.6664  p(95)=47.4598 
    dashboard_duration.............: avg=353.49095   min=76.213  med=306.829  max=1271.067 p(90)=608.3698 p(95)=1109.151
    login_duration.................: avg=2167.048588 min=268.291 med=2169.873 max=2333.787 p(90)=2322.747 p(95)=2329.068
    search_duration................: avg=113.853576  min=33.396  med=95.131   max=400.881  p(90)=211.4582 p(95)=278.6705

    HTTP
    http_req_duration..............: avg=105.94ms    min=1.83ms  med=16.28ms  max=2.33s    p(90)=301.75ms p(95)=415.69ms
      { expected_response:true }...: avg=105.94ms    min=1.83ms  med=16.28ms  max=2.33s    p(90)=301.75ms p(95)=415.69ms
    http_req_failed................: 0.00%  0 out of 5593
    http_reqs......................: 5593   44.24445/s

    EXECUTION
    iteration_duration.............: avg=6.64s       min=6.15s   med=6.46s    max=9.93s    p(90)=6.77s    p(95)=9.39s   
    iterations.....................: 923    7.30156/s
    vus............................: 5      min=5         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 25 MB  198 kB/s
    data_sent......................: 4.9 MB 39 kB/s



running (2m06.4s), 00/50 VUs, 923 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  2m0s
time="2026-08-17T13:36:01+05:30" level=error msg="thresholds on metrics 'dashboard_duration, login_duration' have been crossed"